{
  "intents": [
    {
      "tag": "theme",
      "patterns": ["what is the theme of updates 2k24?","Could you tell me the theme of Updates 2k24?","What theme does Updates 2k24 have?","What is Updates 2k24's theme?"],
      "responses": ["The theme of Updates 2k24 is 'From floppy to the cloud'.","From floppy to the cloud","Updates 2k24 has the theme 'From floppy to the cloud'."]
    },
    {
      "tag": "title sponsors",
      "patterns": ["Who are the title sponsors of updates?","Do you know who the title sponsors of Updates are?","Who holds the title sponsorship for Updates?"],
      "responses": ["The title sponsors are Codewinglet and V.S. Overseas.","Our title sponsors are Codewinglet and V.S. Overseas.","Updates 2k24 is sponsored by Codewinglet and V.S. Overseas as title sponsors.","Title Sponsors: [Codewinglet](https://www.codewinglet.com/), [V.S. Overseas](https://www.instagram.com/v.s.overseas/)"]
    },
    {
      "tag": "faculty coordinators",
      "patterns": ["Who are the faculty coordinators of updates 2k24?", "Main faculty coordinators?"],
      "responses": [
        "The faculty coordinators are Pranav Rathod, Alankrita Vishwakarma, and Saifali Modi.",
        "Pranav Rathod, Alankrita Vishwakarma, and Saifali Modi are the faculty coordinators.",
        "Our faculty coordinators include Pranav Rathod, Alankrita Vishwakarma, and Saifali Modi.",
        "Faculty Coordinators: Pranav Rathod, Alankrita Vishwakarma, Saifali Modi"
      ]
    },
    {
      "tag": "student_coordinators",
      "patterns": ["Who are the student coordinators of updates 2k24?", "main student coordinators?"],
      "responses": [
        "The student coordinators are Zenil Dhameliya, Kaushal Gadhiya, Aum M Patel, Archi Gazdar, and Mitesh Dobariya.",
        "Zenil Dhameliya, Kaushal Gadhiya, Aum M Patel, Archi Gazdar, and Mitesh Dobariya are coordinating the event as student representatives.",
        "Our team of student coordinators includes Zenil Dhameliya, Kaushal Gadhiya, Aum M Patel, Archi Gazdar, and Mitesh Dobariya.",
        "Student Coordinators: Zenil Dhameliya, Kaushal Gadhiya, Aum M Patel, Archi Gazdar, Mitesh Dobariya"
      ]
    },
    {
      "tag": "web_developers",
      "patterns": ["Who are the members of web development team?", "Members of web dev team"],
      "responses": [
        "The web development team includes Dhruvin Vaghani, Nikhar Savaliya, Abhishek Radadiya, Vansh Golakiya, Satyam Tiwari, and Dev Italiya.",
        "Our web developers are Dhruvin Vaghani, Nikhar Savaliya, Abhishek Radadiya, Vansh Golakiya, Satyam Tiwari, and Dev Italiya.",
        "Dhruvin Vaghani, Nikhar Savaliya, Abhishek Radadiya, Vansh Golakiya, Satyam Tiwari, and Dev Italiya form the web development team.",
        "Web Developers: Dhruvin Vaghani, Nikhar Savaliya, Abhishek Radadiya, Vansh Golakiya, Satyam Tiwari, Dev Italiya"
      ]
    },
    {
      "tag": "social_media",
      "patterns": ["Social media handle for updates?","What is the social media handle for Updates?","Where can I find Updates on social media?"],
      "responses": ["Follow us: [Instagram Updates](https://instagram.com/updates2k24)"]
    },
    {
      "tag": "Stock_X_Stake",
      "patterns": ["What is the Stock X Stake event all about?",
"How does the Stock X Stake event work?",
"Who are the coordinators for the Stock X Stake event?"],
      "responses": [
        "Event: Stock X Stake",
        "Tagline: \"Paisa kamya nahi banya jata hai\"",
        "Rules: Round 1: Start with the same balance, investing in 6 companies over 5 rounds with 3 cycles each. Buy or sell one company's stock per cycle using stock up/down cards. Teams with the highest net worth advance to the next round. Round 2: Bidwars with 20 mystery items, 5 items drawn each round. Teams bid on items within the announced price range using their starting capital. Teams with the highest combined item value and remaining cash advance.",
        "Event Coordinators: Kenil Vekriya, Aryan Jadav, Rahul Mehta, Dev Vaghani",
        "Volunteers: Ronak Talaviya, Dhyey Chauhan",
        "More Info: [Event Link](https://www.coupdates.in/event/stock-x-stake)"
      ]
    },
    {
      "tag": "Split_Or_Steal",
      "patterns": ["What is the Split or Steal event about?",
"Can you explain the rules of the Split or Steal event?",
"Who is in charge of the Split or Steal event?"],
      "responses": [
        "Event: Split Or Steal",
        "Tagline: \"Take it or Leave it!\"",
        "Rules: Round 1: Truth or Triumph. Participants cannot change their decision once taken. Splitting is allowed for a maximum of 3 times. Teams made by volunteers are final. Decision by coordinators/volunteers is final and non-arguable. Round 2: Mystery Round. Participants cannot change their decision once taken. Decision by coordinators is final and non-arguable.",
        "Event Coordinators: Ayush Desai, Parth Lathiya, Om Vasoya, Aryan Prajapati",
        "Volunteers: Shreya Patel, Jeel Khunt",
        "More Info: [Event Link](https://www.coupdates.in/event/split-or-steal)"
      ]
    },
    {
      "tag": "Resume_Relay",
      "patterns": ["What happens in the Resume Relay event?",
"How does the Resume Relay event function?",
"Who are the coordinators for the Resume Relay event?"],
      "responses": [
        "Event: Resume Relay",
        "Tagline: \"Resume Ready, Job Steady\"",
        "Rules: Round 1: The 'Role Play Resume' Challenge. Participants will choose one job posting from a selection provided by the organizers. Participants must tailor their resume specifically to the job posting they have chosen. Direct copying of content from any sources is not allowed. Participants may use their own preferred professional format. The resume should not exceed 2 pages in length. Round 2: Pitch Swap Showdown: Resume Meets Voice. Each participant must prepare a 30-second elevator pitch based on the resume they crafted in Round 1. Participants will be randomly paired with another participant. Participants will receive their partner’s pitch and have 10 minutes to review and present it.",
        "Event Coordinators: Rahul Mevada, Manan Parekh, Devanshi Trivedi",
        "Volunteers: Parth Hathiwala",
        "More Info: [Event Link](https://www.coupdates.in/event/the-resume-relay)"
      ]
    },
    {
      "tag": "Meme_Fest",
      "patterns": ["What is the Meme Fest event all about?",
"Can you describe the rules for Meme Fest?",
"Who is organizing Meme Fest?"],
      "responses": [
        "Event: Meme Fest",
        "Tagline: \"Where Memes Meet Madness!\"",
        "Rules: Round 1: Meme Challenge. Complete three types of meme-related questions: Punchline Recovery, Emoji Meme Guessing, and Muted Meme Clips. A surprise question will help participants advance to Round 2. Round 2: Puzzle Challenge. Guess famous personalities or characters based on their shadows. Complete a crossword puzzle related to famous personalities, YouTubers, or other well-known figures.",
        "Event Coordinators: Hetvi Patel, Meet Oza, Nirav Paneliya, Aryan Nimavat",
        "Volunteers: Ansh Patel, Suhani Gohil",
        "More Info: [Event Link](https://www.coupdates.in/event/memefest)"
      ]
    },
    {
      "tag": "Man_In_Middle",
      "patterns": ["What is the Man in the Middle event?",
"How do participants compete in Man in the Middle?",
"Who is coordinating the Man in the Middle event?"],
      "responses": [
        "Event: Man In Middle",
        "Tagline: \"The Art of Interception!\"",
        "Rules: Round 1: Decode the Message. Participants must decode the given words based on substitution technique. Any participant found engaging in unfair practices or violating the integrity of the competition will be immediately disqualified. Round 2: Man in the Middle. A part of participants (sender) has to encrypt their message according to cipher techniques of their choice. Others (man in the middle and receiver) have to decrypt the encrypted message, using appropriate technique, in given time period. Any participant found engaging in unfair practices or violating the integrity of the competition will be immediately disqualified.",
        "Event Coordinators: Aditya Bhakhar, Manthan Lad, Kunj Khimani",
        "Volunteers: Dishali Rabadiya, Mangalya Desai",
        "More Info: [Event Link](https://www.coupdates.in/event/man-in-the-middle)"
      ]
    },
    {
      "tag": "Human_Or_Ai",
      "patterns": ["What is the Human or AI event about?",
"Can you tell me the details of the Human or AI event?",
"Who are the coordinators for the Human or AI event?"],
      "responses": [
        "Event: Human Or Ai",
        "Tagline: \"Where Imagination Meets Innovation\"",
        "Rules: Round 1: Guess the Prompt. Choose one of four given prompts based on displayed images. Using more than one tab (e.g., Google docs) will result in disqualification. Round 2: Prompt Generation. Participants will recreate three displayed images using Microsoft Designer and Adobe image generator. Using more than two tabs (e.g., Google docs & AI image generator) will result in disqualification.",
        "Event Coordinators: Ansh Mangukiya, Alpesh Jasani, Krish Dobariya",
        "Volunteers: Preet Limbasiya, Nisharg Nanavati",
        "More Info: [Event Link](https://www.coupdates.in/event/human-or-ai)"
      ]
    },
    {
      "tag": "Escape_Room",
      "patterns": ["What is the Escape Room event?",
"How does the Escape Room event work?",
"Who are the event coordinators for Escape Room?"],
      "responses": [
        "Event: Escape Room",
        "Tagline: \"Your Mind is the Key OR Challenge the Room, Find the Exit\"",
        "Rules: Round 1: Code Debugging. Platform: Online coding platform. Objective: Participants must debug a given code. Outcome: The platform tracks participants' timing, correctness, and other relevant details. Reward: Upon successfully debugging the code, participants will receive the first two digits necessary for the final stage. Round 2: Circuit Design. Task: Participants will be presented with a demo circuit and a truth table. Objective: Based on the given Problem statement/truth table, participants must design and simulate a circuit. Outcome: Participants will obtain the next two digits after successfully simulating the circuit. Reward: The two digits from the circuit output will contribute to the final stage. Round 3: Riddle Solving. Task: Participants will receive a riddle that hints at the correct arrangement of the four digits obtained from the previous stages. Objective: Solve the riddle to determine the correct order of the digits. Final Goal: Use the arranged digits as a password to unlock the box containing the key to the locked lab. Winning Criteria: The first team to unlock the box and retrieve the key wins the competition. If no team successfully unlocks the box, the winner will be determined based on the best overall timing and performance across all stages.",
        "Event Coordinators: Tirth Asodariya, Aadyanshi Patel, Anjali Jariwala",
        "Volunteers: Om Sonani, Dhyani Solanki",
        "More Info: [Event Link](https://www.coupdates.in/event/escape-the-room)"
      ]
    },
    {
  "tag": "Dev_Battle",
   "patterns": [
    "What is the Dev Battle event about?",
    "Can you explain the rules of Dev Battle?",
    "Who are the coordinators of the Dev Battle event?"
  ],
  "responses": [
    "Event: Dev Battle",
    "Tagline: \"Showcase Your Coding Skills in a Thrilling Competition!\"",
    "Rules: Round 1: Debugging Round (45 minutes) - Questions are written in C language. You need to debug the question and write the output properly. No assistance will be provided with syntax errors, so choose the programming language you are most proficient in. Round 2: Coding Challenge (1.5 hrs) - You can solve the problem in any language you are most proficient in. All test cases should be passed when submitting the answer. Make sure you understand the problem statement thoroughly before starting your code. No assistance or clarifications will be provided.",
    "Event Coordinators: Abhishek Radadiya, Nikhar Savaliya, Dhruvin Vaghani",
    "Volunteers: Prizes and Awards - Candidates who meet the necessary qualifications based on our review may be considered for an interview. Rank and Prize: 1st Prize ₹3000 + Exclusive Gift + Certificate of Achievement, 2nd Prize ₹2000 + Exclusive Gift + Certificate of Achievement, 3rd Prize ₹1000 + Exclusive Gift + Certificate of Achievement",
    "More Info: [Event Link](https://www.coupdates.in/event/devBattle)"
  ]
},
{
  "tag": "Data_Loom",
  "patterns": [
    "What is the Data Loom event?",
    "Can you tell me the rules for Data Loom?",
    "Who is coordinating the Data Loom event?"
  ],
  "responses": [
    "Event: Data Loom",
    "Tagline: \"Weaving Insights from Every Byte.\"",
    "Rules: Round 1: Threading the Data - Perform Exploratory Data Analysis (EDA) on a provided dataset. No external datasets allowed. Round 2: Crafting the Fabric - Use the dataset from Round 1 for cleaning and preprocessing. Create basic models (e.g., regression, classification).",
    "Event Coordinators: Brahmi Shah, Janvi Jain, Deeya Parmar",
    "Volunteers: Vasu Balar, Dhrumil Gabani",
    "More Info: [Event Link](https://www.coupdates.in/event/dataloom)"
  ]
},
{
  "tag": "Cineverse",
  "patterns": [
    "What is the Cineverse event about?",
    "How does the Cineverse event work?",
    "Who are the organizers of the Cineverse event?"
  ],
  "responses": [
    "Event: Cineverse",
    "Tagline: \"Challenge Your Inner Movie Buff!\"",
    "Rules: Round 1 - Quiz Round (\"Lights, Camera, Quiz!\") - Team can consist of a minimum of 2 members and a maximum of 3 members. Each Team must be registered before the start of the event. Questions in this round will cover a variety of topics related to movies, series, songs, characters, singers, etc., including Bollywood and Hollywood categories. These questions may include identifying characters, actors, singers, and related trivia. Questions will be presented in a multiple-choice format or one-word answers. A total of 50 questions will be displayed. Time limit will be 10 seconds per each question. Some images will be intentionally shown as blurred, shadowed, or partial. Round 2 - Buzzer Round (\"Buzz in, Win Big!\") - Identifying Bollywood songs from English Lyrics, Recognizing Movies/Series from signature steps, famous quotes or dialogues, memes, Identifying the name of the song from missing lines of lyrics. Teams will press the buzzer; those who press first will get the chance to answer the question first. If the answer guessed is incorrect, it will result in negative marking. Marking scheme will be explained in detail during the event.",
    "Event Coordinators: Yug Golakiya, Rushi Patel, Priyanshi Dobariya, Shriya Lukhi",
    "Volunteers: Palak Thumber, Jiya Kalathiya",
    "More Info: [Event Link](https://www.coupdates.in/event/cineverse)"
  ]
},
{
  "tag": "Brain_O_Teaser",
  "patterns": [
    "What is the Brain-O-Teaser event?",
    "Can you explain the rules of Brain-O-Teaser?",
    "Who are the event coordinators for Brain-O-Teaser?"
  ],
  "responses": [
    "Event: Brain-O-Teaser",
    "Tagline: \"Trace the Error, Chase the IP\"",
    "Rules: Round 1: Bug Finder & Output Crack - Marks-based evaluation will be done. In case of a tie, time factor will be considered. Round 2: Find your IP and get the key - Participants will be given a couple of codes to solve and reach the final machine, get the key from the computer, and submit it. Time-based evaluation.",
    "Event Coordinators: Krish Padmani, Kirtan Vaghasia, Parva Shah",
    "Volunteers: Jainil Tailor, Parv Shekhaliya",
    "More Info: [Event Link](https://www.coupdates.in/event/brain-o-teaser)"
  ]
},
{
  "tag": "Aavishkar",
  "patterns": [
    "What is the Aavishkar event?",
    "How does the Aavishkar event work?",
    "Who is organizing the Aavishkar event?"
  ],
  "responses": [
    "Event: Aavishkar",
    "Tagline: \"Innovate to Elevate\"",
    "Rules: Round 1 - Participants may present a partial/complete model of their idea or only idea pitching of their product. Participants can provide their list of equipment for making their prototype through Google Classroom (Code will be provided on the registration form). On the day of registration itself, so that we can procure well in time. Students can collect these components from Prof. Bhumika Bhatt by 19th September 12:00 PM so that participants can work on their model within the time frame. Maximum time to pitch an idea/model is 5 to 7 minutes. Each team comprises a maximum of 5 students (if they have an idea with a prototype) or a maximum of 3 students (if only idea pitching).",
    "Event Coordinators: Neeraja Joshi, Preet Viral Jogani, Fenil Patel",
    "Volunteers: Anmol Sandip Aafre",
    "More Info: [Event Link](https://www.coupdates.in/event/avishkaar)"
  ]
}
]
}
